tutorials/6.5.1D_single_phase_Liq_injection_2ComponentLiq_Transport_compositionalDarcyFoam/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp 0.orig 0 -R

runApplication blockMesh

runApplication $(getApplication)

#------------------------------------------------------------------------------